const qBank = [
  {
    question:
      "এখন পর্যন্ত কি করোনাভাইরাসের কোন প্রতিষেধক আবিষ্কার হয়েছে?",
    answers: ["হ্যা", "না"],
    correct: "না",
    questionId: "001"
  },
  {
    question:
      'নিচের কোনটি করোনা ভাইরাসের লক্ষণ নয়?',
    answers: ["জ্বর", "চুলকানী", "শ্বাসকষ্ট", "শুকনো কাশি"],
    correct: "চুলকানী",
    questionId: "002"
  },
  {
    question:
      "করোনা ভাইরাস হলে ওষুধ হিসেবে এন্টিবায়োটিক খেলে কি কোন কাজ হবে?",
    answers: ["হ্যা", "না"],
    correct: "না",
    questionId: "003"
  },
  {
    question:
      'করোনাভাইরাস কতক্ষন পর্যন্ত মাটিতে বা বিভিন্ন বস্তুতে লেগে জীবিত থাকে ?',
    answers: ["৩ ঘন্টা", "৯ ঘন্টা", "১২ ঘন্টা", "সঠিক তথ্য এখনো জানা যায়নি"],
    correct: "সঠিক তথ্য এখনো জানা যায়নি",
    questionId: "004"
  },
  {
    question:
      'বাংলাদেশের আবহাওয়া ও তাপমাত্রায় করোনা ভাইরাস বেচে থাকতে পারে না - কথাটি কি সত্য?',
    answers: ["হ্যা", "না"],
    correct: "না",
    questionId: "005"
  },
  {
    question:
      'গরম পানি পান ও তা দিয়ে কুলি করলে কি করোনা ভাইরাসের জীবানু নষ্ট হয়?',
    answers: ["হ্যা", "না"],
    correct: "না",
    questionId: "006"
  },
  {
    question:
      'নিচের কোন উপায়ে করোনাভাইরাস ছড়ায় না?',
    answers: ["হাচি-কাশি থেকে", "মশার কামড়ে", "হাত অপরিষ্কার রাখলে", "মানুষের ভিড়ে গেলে"],
    correct: "মশার কামড়ে",
    questionId: "007"
  },
  {
    question:
      'বিদেশফেরত প্রবাসীদের কতদিন কোয়ারেন্টাইন / ঘরবন্দী থাকতে হয়?',
    answers: ["১৪ দিন", "১ সপ্তাহ", "২২দিন", "৩দিন"],
    correct: "১৪ দিন",
    questionId: "008"
  },
  {
    question:
      'করোনা ভাইরাস কি ধরনের মানুষদের আক্রান্ত করে?',
    answers: ["ছোট বাচ্চাদের", "বয়স্কদের", "সব ধরণের মানুষদের", "শুধু অমুসলিমদের"],
    correct: "সব ধরণের মানুষদের",
    questionId: "009"
  },
  {
    question:
      'গৃহপালিত পশুপাখি থেকে মানুষের দেহে করোনা ভাইরাস ছড়ানোর সম্ভাবনা কতটুকু?',
    answers: ["প্রচুর সম্ভাবনা", "খুব কম সম্ভাবনা", "কোন সম্ভাবনা নেই"],
    correct: "খুব কম সম্ভাবনা",
    questionId: "010"
  }
];

/* export default (n = 5) =>
  Promise.resolve(qBank.sort(() => 0.5 - Math.random()).slice(0, n)); */
export default () => Promise.resolve(qBank);